
#Область ПрограммныйИнтерфейс 

Функция РассчитатьЗначение(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ДоговорыКонтрагентов.Ссылка КАК ДоговорыКонтрагентов,
	//|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	//|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	//|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Обслуживание,
	//|	НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиента.Дата, МЕСЯЦ) КАК Начало,
	//|	КОНЕЦПЕРИОДА(ВКМ_ОбслуживаниеКлиента.Дата, МЕСЯЦ) КАК Конец
	//|ПОМЕСТИТЬ ВТ_СозданныеОбслуживания
	//|ИЗ
	//|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	//|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ОбслуживаниеКлиента.Договор
	//|ГДЕ
	//|	ДоговорыКонтрагентов.ВидДоговора = &АбоненскоеОбслуживание
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_СозданныеОбслуживания.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов,
	//|	ВТ_СозданныеОбслуживания.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	//|	ВТ_СозданныеОбслуживания.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	//|	ВТ_СозданныеОбслуживания.Обслуживание КАК Обслуживание,
	//|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	//|	РеализацияТоваровУслуг.Дата КАК ДатаРеализации
	//|ПОМЕСТИТЬ ВТ_СозданныеРеализации
	//|ИЗ
	//|	ВТ_СозданныеОбслуживания КАК ВТ_СозданныеОбслуживания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|		ПО ВТ_СозданныеОбслуживания.ДоговорыКонтрагентов = РеализацияТоваровУслуг.Договор
	//|			И (РеализацияТоваровУслуг.Дата МЕЖДУ ВТ_СозданныеОбслуживания.Начало И ВТ_СозданныеОбслуживания.Конец)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_СозданныеРеализации.Реализация КАК Реализация,
	//|	ВТ_СозданныеРеализации.ДатаРеализации КАК ДатаРеализации
	//|ИЗ
	//|	ВТ_СозданныеРеализации КАК ВТ_СозданныеРеализации
	//|ГДЕ
	//|	ВТ_СозданныеРеализации.Реализация ЕСТЬ НЕ NULL 
	//|	И ВТ_СозданныеРеализации.ДатаРеализации МЕЖДУ &ДатаНачала И &ДатаОкончания
	//|	И ВТ_СозданныеРеализации.Реализация.Договор = &Договор";
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговораАбоненскоеОбслуживание
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ДатаНачала
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ВидДоговораАбоненскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СсылкиНаОбъекты = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
			НовыйДок.Договор = ВыборкаДетальныеЗаписи.Договор;
			НовыйДок.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			НовыйДок.Организация = ВыборкаДетальныеЗаписи.Организация;
			НовыйДок.ВыполнитьАвтозаполнение(НовыйДок.Услуги);
			НовыйДок.Комментарий = "Создан обработкой Массовое создание актов";
			Попытка
				//Если Не НовыйДок.ПроверитьЗаполнение() Тогда
				//	Продолжить;
				//КонецЕсли;
				НовыйДок.Записать();
				НовыйДокСсылка = НовыйДок.Ссылка;
				////
				//НовыйДокОбъект.Заполнить(
				////
				ДоговорУникальныйИдент = Строка(ВыборкаДетальныеЗаписи.Договор.УникальныйИдентификатор());
				РеализацияУникальныйИдент = Строка(НовыйДокСсылка.УникальныйИдентификатор());
				
				ДанныеДляТабЧасти = Новый Структура;
				ДанныеДляТабЧасти.Вставить("Договор", ДоговорУникальныйИдент);
				ДанныеДляТабЧасти.Вставить("Реализация", РеализацияУникальныйИдент);
				
				СсылкиНаОбъекты.Добавить(ДанныеДляТабЧасти);
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗаписатьЗначениеJSON(СсылкиНаОбъекты);
	
КонецФункции

#КонецОбласти
